Reports/АнализРаспределенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>АнализРаспределенияНДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаПоДокументам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРаспределения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспределениеНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ПартииНДСКРаспределению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииНДСКРаспределению</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоимостьРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КорВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеСчетФактураВыданный</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаОтраженияРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодБазы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаАктивовПассивов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступленияРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочиеДоходыРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПринятыхНаХранениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеРасходовБудущихПериодов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваровУХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПриобретения</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочееОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.НачисленияКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваровУХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученныйНалоговыйАгент</v8:Type>
						<v8:Type>cfg:DocumentRef.ПорчаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураНалоговыйАгент</v8:Type>
						<v8:Type>cfg:DocumentRef.ПорчаТоваровУХранителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФактическомуИспользованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортСырьевыхТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортНесырьевыхТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОСВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяРаспределением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСДЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияРаботУслугНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаПоПатенту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РаспределениеНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РаспределениеНДС</Name>
			<Comment>Распределение НДС по видам налогообложения</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПоНДС</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ПартииПрочихРасходов</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеАктивыПассивы</xr:Item>
				<xr:Item>AccumulationRegister.ПартииНДСКРаспределению</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПокупок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаНеНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаЕНВД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаНДС0</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьНДСПоРасходамАктивамНаСтатьиОтражения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовНеНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходовНеНДС</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовЕНВД</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходовЕНВД</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределенияУстанавливаетсяВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименитьПравило5Процентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаНДС0СырьевыеТоварыУслуги</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаНДС0НесырьевыеТовары</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаНеРФ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыЭкспорт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеСчетФактураВыданный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыручки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректировкаВыручки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/АнализРаспределенияНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// Возвращаемое значение:
//   СтрокаТаблицыЗначений - новая команда отчета.
Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.АнализРаспределенияНДС) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.АнализРаспределенияНДС.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Анализ распределения НДС'");
		КомандаОтчет.МножественныйВыбор = Истина;
		КомандаОтчет.Важность = "Обычное";
		КомандаОтчет.КлючВарианта = "АнализРаспределенияНДС";
		
		Возврат КомандаОтчет;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//  ДокументОбъект - если указан, то печать отчета по документу.
//
Процедура СформироватьОтчет(Знач ПараметрыОтчета, АдресХранилища) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ДокументРезультат.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб			= Истина;
	
	Макет = Отчеты.АнализРаспределенияНДС.ПолучитьМакет("Таблица");
	
	ОбластьЗаголовок  = Макет.ПолучитьОбласть("Заголовок");
	
	Заголовок = НСтр("ru = 'Анализ распределения сумм НДС'");
	
	РеквизитыДокументаРаспределения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыОтчета.ДокументРаспределения, "Организация, Дата");
	ДокументРаспределенияЗаполнен = ЗначениеЗаполнено(ПараметрыОтчета.ДокументРаспределения);
	
	НачалоПериода = ?(НЕ ДокументРаспределенияЗаполнен, НачалоПериода, НачалоКвартала(РеквизитыДокументаРаспределения.Дата));
	КонецПериода  = ?(НЕ ДокументРаспределенияЗаполнен, КонецПериода, КонецКвартала(РеквизитыДокументаРаспределения.Дата));
	
	ОбластьЗаголовок.Параметры.Период = "Период: " + ПредставлениеПериода(НачалоДня(ПараметрыОтчета.НачалоПериода), КонецДня(ПараметрыОтчета.КонецПериода)) + ?(НЕ ПараметрыОтчета.ВыручкаПоДокументам, "", " по документу """ + ПараметрыОтчета.ДокументРаспределения + """");

	СведенияОбОрганизации	= БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(
		?(ДокументРаспределенияЗаполнен, РеквизитыДокументаРаспределения.Организация, ПараметрыОтчета.Организация),
		ПараметрыОтчета.КонецПериода);
		
	ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
	ОбластьЗаголовок.Параметры.НазваниеОрганизации = ПредставлениеОрганизации;
	
	ОбластьЗаголовок.Параметры.Заголовок	= Заголовок;
	
	ОбластьЗаголовок.Параметры.ИННОрганизации	= СокрЛП(СведенияОбОрганизации.ИНН)
												+ ?(ЗначениеЗаполнено(СведенияОбОрганизации.КПП)," / ", "")
												+ СокрЛП(СведенияОбОрганизации.КПП);
	
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	
	ВыводитьОбщийЭкспорт = 
		НЕ УчетНДСРФ.УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту(ПараметрыОтчета.НачалоПериода)
		И ПолучитьФункциональнуюОпцию("ИспользоватьПродажиНаЭкспорт");
		
	ВыводитьЭкспортНесырьевыхТоваров = 
		УчетНДСРФ.УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту(ПараметрыОтчета.КонецПериода)
		И ПолучитьФункциональнуюОпцию("ИспользоватьПродажиНаЭкспортНесырьевыхТоваров");
		
	ВыводитьЭкспортСырьевыхТоваровУслуг = 
		УчетНДСРФ.УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту(ПараметрыОтчета.КонецПериода)
		И ПолучитьФункциональнуюОпцию("ИспользоватьПродажиНаЭкспортСырьевыхТоваровУслуг");
		
	ПараметрыОтчета.Вставить("ВыводитьОбщийЭкспорт",                ВыводитьОбщийЭкспорт);
	ПараметрыОтчета.Вставить("ВыводитьЭкспортНесырьевыхТоваров",    ВыводитьЭкспортНесырьевыхТоваров);
	ПараметрыОтчета.Вставить("ВыводитьЭкспортСырьевыхТоваровУслуг", ВыводитьЭкспортСырьевыхТоваровУслуг);
	
	
	ВыборкаПериодыБазы = ПериодыБазы(ПараметрыОтчета);
	Пока ВыборкаПериодыБазы.Следующий() Цикл
		
		ПериодБазы = ВыборкаПериодыБазы.ПериодБазы; 
		
		ВывестиВОтчетДанныеПоБазеРаспределения(ПериодБазы, ПараметрыОтчета, ДокументРезультат, Макет);
		
		ВывестиВОтчетДанныеПоРаспределениюКосвенныхРасходов(ПериодБазы, ПараметрыОтчета, ДокументРезультат, Макет);
	КонецЦикла;
	
	
	ПоместитьВоВременноеХранилище(ДокументРезультат, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПериодыБазы(ПараметрыОтчета)
	
	Запрос = Новый Запрос;
	
	Если НЕ ПараметрыОтчета.ВыручкаПоДокументам Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР 
		|		КОГДА ПартииНДСКРаспределению.ПериодБазы <> ДАТАВРЕМЯ(1,1,1)
		|			ТОГДА КОНЕЦПЕРИОДА(ПартииНДСКРаспределению.ПериодБазы, МЕСЯЦ)
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ПартииНДСКРаспределению.Период, МЕСЯЦ)
		|	КОНЕЦ КАК ПериодБазы
		|ИЗ
		|	РегистрНакопления.ПартииНДСКРаспределению КАК ПартииНДСКРаспределению
		|ГДЕ
		|	ПартииНДСКРаспределению.Организация = &Организация
		|	И ПартииНДСКРаспределению.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПартииНДСКРаспределению.Регистратор ССЫЛКА Документ.РаспределениеНДС
		|";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР 
		|		КОГДА ПартииНДСКРаспределению.ПериодБазы <> ДАТАВРЕМЯ(1,1,1)
		|			ТОГДА КОНЕЦПЕРИОДА(ПартииНДСКРаспределению.ПериодБазы, МЕСЯЦ)
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ПартииНДСКРаспределению.Период, МЕСЯЦ)
		|	КОНЕЦ КАК ПериодБазы
		|ИЗ
		|	РегистрНакопления.ПартииНДСКРаспределению КАК ПартииНДСКРаспределению
		|ГДЕ
		|	ПартииНДСКРаспределению.Регистратор = &Ссылка
		|";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", 	ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", 	КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Ссылка", 		ПараметрыОтчета.ДокументРаспределения);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Выполняет запрос и формирует таблицу соответствующую базе распределения
// косвенных расходов.
//
Процедура ВывестиВОтчетДанныеПоБазеРаспределения(ПериодБазы, ПараметрыОтчета, ДокументРезультат, Макет)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаспределениеНДС.Ссылка КАК ДокументРаспределения,
	|	СУММА(РаспределениеНДС.ВыручкаЕНВД) КАК ВыручкаЕНВД,
	|	СУММА(РаспределениеНДС.ВыручкаНеНДС) КАК ВыручкаНеНДС,
	|	СУММА(РаспределениеНДС.ВыручкаНДС0) КАК ВыручкаНДС0,
	|	СУММА(РаспределениеНДС.ВыручкаНДС0СырьевыеТоварыУслуги) КАК ВыручкаНДС0СырьевыеТоварыУслуги,
	|	СУММА(РаспределениеНДС.ВыручкаНДС0НесырьевыеТовары) КАК ВыручкаНДС0НесырьевыеТовары,
	|	СУММА(РаспределениеНДС.ВыручкаНДС + РаспределениеНДС.ВыручкаНеРФ) КАК ВыручкаНДС,
	|	СУММА(РаспределениеНДС.ВыручкаЕНВД)
	|		+ СУММА(РаспределениеНДС.ВыручкаНеНДС)
	|		+ СУММА(РаспределениеНДС.ВыручкаНДС0СырьевыеТоварыУслуги)
	|		+ СУММА(РаспределениеНДС.ВыручкаНДС0НесырьевыеТовары)
	|		+ СУММА(РаспределениеНДС.ВыручкаНДС)
	|		+ СУММА(РаспределениеНДС.ВыручкаНеРФ) КАК ВсегоВыручка
	|ИЗ
	|	Документ.РаспределениеНДС КАК РаспределениеНДС
	|ГДЕ
	|	РаспределениеНДС.Организация = &Организация
	|	И РаспределениеНДС.Проведен
	|	И КОНЕЦПЕРИОДА(РаспределениеНДС.Дата, МЕСЯЦ) = &ПериодБазы
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспределениеНДС.Ссылка";
		
	
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("ПериодБазы", 	ПериодБазы);
	
	Результат = Запрос.Выполнить().Выбрать();	
	
	СтруктураПараметровВывода = Новый Структура;
	СтруктураПараметровВывода.Вставить("ОбщийЭкспорт",                ПараметрыОтчета.ВыводитьОбщийЭкспорт);
	СтруктураПараметровВывода.Вставить("ЭкспортНесырьевыхТоваров",    ПараметрыОтчета.ВыводитьЭкспортНесырьевыхТоваров);
	СтруктураПараметровВывода.Вставить("ЭкспортСырьевыхТоваровУслуг", ПараметрыОтчета.ВыводитьЭкспортСырьевыхТоваровУслуг);
	
	СтруктураДопОбласей = Новый Структура;
	СтруктураДопОбласей.Вставить("ПараметрыБазыРаспределения");
	СтруктураДопОбласей.Вставить("СтрокаБазыРаспределения");
	
	Для каждого ДопОбласть Из СтруктураДопОбласей Цикл
		МассивДопОбластейШапки = Новый Массив;
		Для каждого ПараметрВывода Из СтруктураПараметровВывода Цикл
			Если НЕ ПараметрВывода.Значение Тогда
				Продолжить;
			КонецЕсли;
			МассивДопОбластейШапки.Добавить(Макет.ПолучитьОбласть(ДопОбласть.Ключ + "|" + ПараметрВывода.Ключ));
		КонецЦикла;
		СтруктураДопОбласей[ДопОбласть.Ключ] = МассивДопОбластейШапки;
	КонецЦикла;

	ОбластьШапкаТаблицы  = Макет.ПолучитьОбласть("ПараметрыБазыРаспределения|Основное");
	ПериодБазыПредставление = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(НачалоКвартала(ПериодБазы), ПериодБазы, Истина);
	ОбластьШапкаТаблицы.Параметры.ПериодБазы = СтрЗаменить(ПериодБазыПредставление, НСтр("ru = 'квартал'"), НСтр("ru = 'квартала'"));
	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
	Для каждого Область Из СтруктураДопОбласей["ПараметрыБазыРаспределения"] Цикл
		ДокументРезультат.Присоединить(Область);
	КонецЦикла;
	
	Результат.Сбросить();
	Пока Результат.Следующий() Цикл
		
		ОбластьШапкаТаблицы  = Макет.ПолучитьОбласть("СтрокаБазыРаспределения|Основное");
		ОбластьШапкаТаблицы.Параметры.Заполнить(Результат);
		ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
		
		Для каждого Область Из СтруктураДопОбласей["СтрокаБазыРаспределения"] Цикл
			Область.Параметры.Заполнить(Результат);
			ДокументРезультат.Присоединить(Область);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет запрос к регистру НДСПоКосвеннымРасходам
// и выбирает информацию по косвенным расходам текущего периода, которые были
// распределены на соответствующие ставки реализации.
//
Процедура ВывестиВОтчетДанныеПоРаспределениюКосвенныхРасходов(ПериодБазы, ПараметрыОтчета, ДокументРезультат, Макет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(СчетФактураПолученный.Ссылка,ЕСТЬNULL(ИнойДокументПодтвержденияНДС.Ссылка,СчетФактураПолученныйНА.Ссылка)) КАК СчетФактураПолученный,
	|	ПартииНДСКРаспределению.ДокументПоступленияРасходов КАК ДокументПоступления
	|ПОМЕСТИТЬ ТаблицаСчетовФактур
	|ИЗ
	|	РегистрНакопления.ПартииНДСКРаспределению КАК ПартииНДСКРаспределению
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
	|		ПО 
	|			ПартииНДСКРаспределению.ДокументПоступленияРасходов = СчетФактураПолученный.ДокументОснование
	|			И СчетФактураПолученный.Ссылка.Проведен
	|			И НЕ СчетФактураПолученный.Ссылка.Исправление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученныйНалоговыйАгент КАК СчетФактураПолученныйНА
	|		ПО 
	|			ПартииНДСКРаспределению.ДокументПоступленияРасходов = СчетФактураПолученныйНА.Ссылка
	|			И СчетФактураПолученныйНА.Проведен
	|			И НЕ СчетФактураПолученныйНА.Исправление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнойДокументПодтвержденияНДС КАК ИнойДокументПодтвержденияНДС
	|		ПО 
	|			ПартииНДСКРаспределению.ДокументПоступленияРасходов = ИнойДокументПодтвержденияНДС.Ссылка
	|			И ИнойДокументПодтвержденияНДС.Проведен
	|ГДЕ
	|	ПартииНДСКРаспределению.Регистратор ССЫЛКА Документ.РаспределениеНДС
	|	И ПартииНДСКРаспределению.Организация = &Организация
	|	И ПартииНДСКРаспределению.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииНДСКРаспределению.Регистратор КАК ДокументРаспределения,
	|	ЕСТЬNULL(ТаблицаСчетовФактур.СчетФактураПолученный, НЕОПРЕДЕЛЕНО) КАК СчетФактураПолученный,
	|	ПартииНДСКРаспределению.ДокументПоступленияРасходов КАК ДокументПоступления,
	|	СУММА(ПартииНДСКРаспределению.СтоимостьРегл) КАК ВсегоСумма,
	|	СУММА(ПартииНДСКРаспределению.НДСРегл) КАК ВсегоНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииНДСКРаспределению.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ТОГДА ПартииНДСКРаспределению.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БезНДССумма,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииНДСКРаспределению.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ТОГДА ПартииНДСКРаспределению.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииНДСКРаспределению.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|				ТОГДА ПартииНДСКРаспределению.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЕНВДСумма,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииНДСКРаспределению.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|				ТОГДА ПартииНДСКРаспределению.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЕНВДНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииНДСКРаспределению.КорВидДеятельностиНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|																ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт))
	|				ТОГДА ПартииНДСКРаспределению.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииНДСКРаспределению.КорВидДеятельностиНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|																ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт))
	|				ТОГДА ПартииНДСКРаспределению.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДС,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииНДСКРаспределению.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|				ТОГДА ПартииНДСКРаспределению.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДС0Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииНДСКРаспределению.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|				ТОГДА ПартииНДСКРаспределению.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДС0,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииНДСКРаспределению.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)
	|				ТОГДА ПартииНДСКРаспределению.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДС0СуммаНесырьевыеТовары,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииНДСКРаспределению.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)
	|				ТОГДА ПартииНДСКРаспределению.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДС0НесырьевыеТовары,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииНДСКРаспределению.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг)
	|				ТОГДА ПартииНДСКРаспределению.СтоимостьРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДС0СуммаСырьевыеТоварыУслуги,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииНДСКРаспределению.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг)
	|				ТОГДА ПартииНДСКРаспределению.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДС0СырьевыеТоварыУслуги
	|ИЗ
	|	РегистрНакопления.ПартииНДСКРаспределению КАК ПартииНДСКРаспределению
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК ТаблицаСчетовФактур
	|		ПО ПартииНДСКРаспределению.ДокументПоступленияРасходов = ТаблицаСчетовФактур.ДокументПоступления
	|ГДЕ
	|	ПартииНДСКРаспределению.Регистратор ССЫЛКА Документ.РаспределениеНДС
	|	И ПартииНДСКРаспределению.Организация = &Организация
	|	И ПартииНДСКРаспределению.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВЫБОР 
	|		КОГДА ПартииНДСКРаспределению.ПериодБазы <> ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА КОНЕЦПЕРИОДА(ПартииНДСКРаспределению.ПериодБазы, МЕСЯЦ)
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ПартииНДСКРаспределению.Период, МЕСЯЦ)
	|	КОНЕЦ = &ПериодБазы
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииНДСКРаспределению.Регистратор,
	|	ЕСТЬNULL(ТаблицаСчетовФактур.СчетФактураПолученный, НЕОПРЕДЕЛЕНО),
	|	ПартииНДСКРаспределению.ДокументПоступленияРасходов
	|
	|ИМЕЮЩИЕ
	|	СУММА(ПартииНДСКРаспределению.НДСРегл) <> 0
	|
	|ИТОГИ ПО
	|	ОБЩИЕ,
	|	ДокументРаспределения
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", 	ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("ПериодБазы", 	ПериодБазы);
	Запрос.УстановитьПараметр("КонецПериода",  	КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("КонецПериодаГраница", Новый Граница(КонецДня(ПараметрыОтчета.КонецПериода), ВидГраницы.Включая));
	
	ВыборкаЗатраты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаЗатраты.Количество() > 0 Тогда
		
		ОбластьШапка= Макет.ПолучитьОбласть("ШапкаТаблицыЗатраты|Основное");
		ОбластьДокументОсновное = Макет.ПолучитьОбласть("СтрокаДокументРаспределенияЗатраты|Основное");
		ОбластьСтрокаОсновное   = Макет.ПолучитьОбласть("СтрокаЗатраты|Основное");
		ОбластьИтогиОсновное    = Макет.ПолучитьОбласть("ИтогиЗатраты|Основное");
		
		СтруктураПараметровВывода = Новый Структура;
		СтруктураПараметровВывода.Вставить("ОбщийЭкспорт",                ПараметрыОтчета.ВыводитьОбщийЭкспорт);
		СтруктураПараметровВывода.Вставить("ЭкспортНесырьевыхТоваров",    ПараметрыОтчета.ВыводитьЭкспортНесырьевыхТоваров);
		СтруктураПараметровВывода.Вставить("ЭкспортСырьевыхТоваровУслуг", ПараметрыОтчета.ВыводитьЭкспортСырьевыхТоваровУслуг);
		
		СтруктураДопОбласей = Новый Структура;
		СтруктураДопОбласей.Вставить("ШапкаТаблицыЗатраты");
		СтруктураДопОбласей.Вставить("СтрокаДокументРаспределенияЗатраты");
		СтруктураДопОбласей.Вставить("СтрокаЗатраты");
		СтруктураДопОбласей.Вставить("ИтогиЗатраты");
		
		Для каждого ДопОбласть Из СтруктураДопОбласей Цикл
			МассивДопОбластейШапки = Новый Массив;
			Для каждого ПараметрВывода Из СтруктураПараметровВывода Цикл
				Если НЕ ПараметрВывода.Значение Тогда
					Продолжить;
				КонецЕсли;
				МассивДопОбластейШапки.Добавить(Макет.ПолучитьОбласть(ДопОбласть.Ключ + "|" + ПараметрВывода.Ключ));
			КонецЦикла;
			СтруктураДопОбласей[ДопОбласть.Ключ] = МассивДопОбластейШапки;
		КонецЦикла;
		
		ОбластьШапка.Параметры.НаименованиеСекции = НСтр("ru = 'Результаты распределения НДС'");		
		ДокументРезультат.Вывести(ОбластьШапка);
		
		Для каждого Область Из СтруктураДопОбласей["ШапкаТаблицыЗатраты"] Цикл
			ДокументРезультат.Присоединить(Область);
		КонецЦикла;
		
		Пока ВыборкаЗатраты.Следующий() Цикл
			
			ВыборкаДокументы = ВыборкаЗатраты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДокументы.Следующий() Цикл
				
				ОбластьДокументОсновное.Параметры.Заполнить(ВыборкаДокументы);
				ДокументРезультат.Вывести(ОбластьДокументОсновное);
				
				Для каждого Область Из СтруктураДопОбласей["СтрокаДокументРаспределенияЗатраты"] Цикл
					Область.Параметры.Заполнить(ВыборкаДокументы);
					ДокументРезультат.Присоединить(Область);
				КонецЦикла;
					
				ВыборкаСтроки = ВыборкаДокументы.Выбрать();
				Пока ВыборкаСтроки.Следующий() Цикл
					
					ОбластьСтрокаОсновное.Параметры.Заполнить(ВыборкаСтроки);
					ДокументРезультат.Вывести(ОбластьСтрокаОсновное);
					
					Для каждого Область Из СтруктураДопОбласей["СтрокаЗатраты"] Цикл
						Область.Параметры.Заполнить(ВыборкаСтроки);
						ДокументРезультат.Присоединить(Область);
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
			ОбластьИтогиОсновное.Параметры.Заполнить(ВыборкаЗатраты);
			ДокументРезультат.Вывести(ОбластьИтогиОсновное);
			
			Для каждого Область Из СтруктураДопОбласей["ИтогиЗатраты"] Цикл
				Область.Параметры.Заполнить(ВыборкаЗатраты);
				ДокументРезультат.Присоединить(Область);
			КонецЦикла;
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
